In [1]:
import pandas as pd
from datetime import date, timedelta
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()

data_path = "../data/"
csv_path = "\\Users\\User\\iCloudDrive\\"
box_path = "\\Users\\User\\Dropbox\\"

#year = 2022
name = 'PTTGC'
buy_date = '2021-03-17'

In [2]:
format_dict = {'qty':'{:,}',
              'sell_price':'{:,.2f}','buy_price':'{:,.2f}','diff':'{:,.2f}',
              'sell_amt':'{:,.2f}','buy_amt':'{:,.2f}','gross':'{:,.2f}','profit':'{:,.2f}',
              'pct':'{:,.2f}%','net':'{:,.2f}',
              'cost_amt':'{:,.2f}','unit_cost':'{:,.2f}','avg_cost':'{:,.2f}'}

pd.set_option('display.float_format','{:,.2f}'.format)

### Record selection for transactions

In [3]:
sql = '''
SELECT name, YEAR(sells.date) AS sell_year, MONTH(sells.date) AS sell_month,  
             YEAR(buys.date) AS buy_year, MONTH(buys.date) AS buy_month,
sells.price AS sell_price, buys.price AS buy_price, 
(sells.price - buys.price) AS diff, qty, 
(sells.price * qty) AS sell_amt,
(buys.price * qty) AS buy_amt,
(sells.price - buys.price) * qty AS gross, 
ROUND((sells.price - buys.price)/buys.price*100,2) AS pct, profit, buys.kind
FROM sells JOIN buys ON sells.buy_id = buys.id
JOIN stocks ON buys.stock_id = stocks.id
WHERE name = '%s' AND buys.date >= '%s'
ORDER BY sell_year DESC, sell_month DESC, name'''

sql = sql % (name, buy_date)
sells_df = pd.read_sql(sql, conpf)
print(sql)

SELECT name, YEAR(sells.date) AS sell_year, MONTH(sells.date) AS sell_month,
             YEAR(buys.date) AS buy_year, MONTH(buys.date) AS buy_month,
sells.price AS sell_price, buys.price AS buy_price,
(sells.price - buys.price) AS diff, qty,
(sells.price * qty) AS sell_amt,
(buys.price * qty) AS buy_amt,
(sells.price - buys.price) * qty AS gross,
ROUND((sells.price - buys.price)/buys.price*100,2) AS pct, profit, buys.kind
FROM sells JOIN buys ON sells.buy_id = buys.id
JOIN stocks ON buys.stock_id = stocks.id
WHERE name = 'PTTGC' AND buys.date >= '2021-03-17'
ORDER BY sell_year DESC, sell_month DESC, name

In [4]:
sells_df

,name,sell_year,sell_month,buy_year,buy_month,sell_price,buy_price,diff,qty,sell_amt,buy_amt,gross,pct,profit,kind
0,PTTGC,2021,12,2021,3,58.75,66.75,-8.00,600,"35,250.00","40,050.00","-4,800.00",-11.99,"-4,966.78",DTD
1,PTTGC,2021,12,2021,4,58.75,66.75,-8.00,1000,"58,750.00","66,750.00","-8,000.00",-11.99,"-8,277.96",DTD

In [5]:
sells_df[['gross','profit','qty']].sum()

gross    -12,800.00
profit   -13,244.74
qty        1,600.00
dtype: float64

In [11]:
profit = -13244.74
profit

-13244.74

### Record selection for active stocks

In [6]:
sql = '''
SELECT name, buys.date AS buy_date,
buys.price AS unit_cost, qty, 
(buys.price * qty) AS cost_amt, net
FROM buys
JOIN stocks ON buys.stock_id = stocks.id
WHERE name = '%s' AND status = 'Active'
ORDER BY name, buys.date'''
sql = sql % name
buys_df = pd.read_sql(sql, conpf)
buys_df.style.format(format_dict)

In [7]:
buys_df[['cost_amt','net','qty']].sum()

cost_amt   388,500.00
net        389,360.49
qty          6,000.00
dtype: float64

In [14]:
sql = '''
SELECT name, p_date, FORMAT(amt,2) AS amt, FORMAT(net,2) AS net, format(amt-net,2) AS refund,
year, quarter AS q, x_date, number, ppu, (net / number * 1000) AS div_1k
FROM dividends
WHERE name = '%s' AND x_date > '%s'
ORDER BY p_date DESC'''
sql = sql % (name, buy_date)
print(sq)
dtl_by_month = pd.read_sql(sql, conpf)
dtl_by_month

,name,p_date,amt,net,refund,year,q,x_date,number,ppu,div_1k
0,PTTGC,2021-09-21,"16,000.00","14,400.00","1,600.00",2021,2,2021-08-23,8000,2.00,"1,800.00"

In [17]:
new_ppu = 1.75
new_qty = 9000
new_div = new_qty * new_ppu * .9
new_div

14175.0

In [18]:
net_profit = profit + new_div
net_profit

930.2600000000002

In [19]:
yearly_ppu = 3.75
yearly_qty = 9000
yearly_div = yearly_qty * yearly_ppu * .9
yearly_div

30375.0